# -*- coding: utf-8 -*-
# @Time    : 2020/10/22 10:25
# @Author  : Xiachuankun
# @Email   : 1364707232@qq.com
# @File    : snippts.py
# @Software: Vs Code
from config import Config
import torch
import torch.nn as nn
import torch.nn.init as init
import os
config = Config()


def load_checkpoint(checkpoint, optimizer=True):
    """Loads entire model from file_path. If optimizer is True, loads
    optimizer assuming it is present in checkpoint.
    Args:
        checkpoint: (string) filename which needs to be loaded
        optimizer: (bool) resume optimizer from checkpoint
    """
    if not os.path.exists(checkpoint):
        raise ValueError("File doesn't exist {}".format(checkpoint))
    checkpoint = torch.load(checkpoint, map_location=torch.device('cpu'))

    if optimizer:
        return checkpoint['model'], checkpoint['optim']
    return checkpoint['model']

class FGM():
    """
    对抗训练方法类
    """

    def __init__(self, model):

        self.model = model

        self.backup = {}

    def attack(self, epsilon=1., emb_name=config.embed_name):
        # emb_name这个参数要换成你模型中embedding的参数名
        for name, param in self.model.named_parameters():
            if param.requires_grad and emb_name in name:
                self.backup[name] = param.data.clone()
                norm = torch.norm(param.grad)
                if norm != 0 and not torch.isnan(norm):
                    r_at = epsilon * param.grad / norm
                    param.data.add_(r_at)

    def restore(self, emb_name=config.embed_name):
        # emb_name这个参数要换成你模型中embedding的参数名
        for name, param in self.model.named_parameters():
            if param.requires_grad and emb_name in name:
                assert name in self.backup
                param.data = self.backup[name]
        self.backup = {}





class PGD():
    def __init__(self, model):
        self.model = model
        self.emb_backup = {}
        self.grad_backup = {}

    def attack(self, epsilon=1., alpha=0.3, emb_name=config.embed_name, is_first_attack=False):
        # emb_name这个参数要换成你模型中embedding的参数名
        for name, param in self.model.named_parameters():
            if param.requires_grad and emb_name in name:
                if is_first_attack:
                    self.emb_backup[name] = param.data.clone()
                norm = torch.norm(param.grad)
                if norm != 0 and not torch.isnan(norm):
                    r_at = alpha * param.grad / norm
                    param.data.add_(r_at)
                    param.data = self.project(name, param.data, epsilon)

    def restore(self, emb_name=config.embed_name):
        # emb_name这个参数要换成你模型中embedding的参数名
        for name, param in self.model.named_parameters():
            if param.requires_grad and emb_name in name:
                assert name in self.emb_backup
                param.data = self.emb_backup[name]
        self.emb_backup = {}

    def project(self, param_name, param_data, epsilon):
        r = param_data - self.emb_backup[param_name]
        if torch.norm(r) > epsilon:
            r = epsilon * r / torch.norm(r)
        return self.emb_backup[param_name] + r

    def backup_grad(self):
        for name, param in self.model.named_parameters():
            if param.requires_grad:
                # print(name)
                try:
                    self.grad_backup[name] = param.grad.clone()
                except:
                    self.grad_backup[name] = None
                    pass

    def restore_grad(self):
        for name, param in self.model.named_parameters():
            if param.requires_grad:
                param.grad = self.grad_backup[name]

def initial_parameter(net, initial_method=None):
    r"""A method used to initialize the weights of PyTorch models.

    :param net: a PyTorch model or a List of Pytorch model
    :param str initial_method: one of the following initializations.

            - xavier_uniform
            - xavier_normal (default)
            - kaiming_normal, or msra
            - kaiming_uniform
            - orthogonal
            - sparse
            - normal
            - uniform

    """
    if initial_method == 'xavier_uniform':
        init_method = init.xavier_uniform_
    elif initial_method == 'xavier_normal':
        init_method = init.xavier_normal_
    elif initial_method == 'kaiming_normal' or initial_method == 'msra':
        init_method = init.kaiming_normal_
    elif initial_method == 'kaiming_uniform':
        init_method = init.kaiming_uniform_
    elif initial_method == 'orthogonal':
        init_method = init.orthogonal_
    elif initial_method == 'sparse':
        init_method = init.sparse_
    elif initial_method == 'normal':
        init_method = init.normal_
    elif initial_method == 'uniform':
        init_method = init.uniform_
    else:
        init_method = init.xavier_normal_

    def weights_init(m):
        # classname = m.__class__.__name__
        if isinstance(m, nn.Conv2d) or isinstance(m, nn.Conv1d) or isinstance(m, nn.Conv3d):  # for all the cnn
            if initial_method is not None:
                init_method(m.weight.data)
            else:
                init.xavier_normal_(m.weight.data)
            init.normal_(m.bias.data)
        elif isinstance(m, nn.LSTM):
            for w in m.parameters():
                if len(w.data.size()) > 1:
                    init_method(w.data)  # weight
                else:
                    init.normal_(w.data)  # bias
        elif m is not None and hasattr(m, 'weight') and \
                hasattr(m.weight, "requires_grad"):
            if len(m.weight.size()) > 1:
                init_method(m.weight.data)
            else:
                init.normal_(m.weight.data)
        else:
            for w in m.parameters():
                if w.requires_grad:
                    if len(w.data.size()) > 1:
                        init_method(w.data)  # weight
                    else:
                        init.normal_(w.data)  # bias
                # print("init else")

    if isinstance(net, list):
        for n in net:
            n.apply(weights_init)
    else:
        net.apply(weights_init)

import re


def split_text(text, maxlen, split_pat=None, greedy=False):
    """文本分片
    将超过长度的文本分片成多段满足最大长度要求的最长连续子文本
    约束条件：1）每个子文本最大长度不超过maxlen；
             2）所有的子文本的合集要能覆盖原始文本。
    Arguments:
        text {str} -- 原始文本
        maxlen {int} -- 最大长度

    Keyword Arguments:
        split_pat {str or re pattern} -- 分割符模式 (default: {SPLIT_PAT})
        greedy {bool} -- 是否选择贪婪模式 (default: {False})
                         贪婪模式：在满足约束条件下，选择子文本最多的分割方式
                         非贪婪模式：在满足约束条件下，选择冗余度最小且交叉最为均匀的分割方式

    Returns:
        tuple -- 返回子文本列表以及每个子文本在原始文本中对应的起始位置列表
    """
    STOPS = (
        '\uFF01'  # Fullwidth exclamation mark
        '\uFF1F'  # Fullwidth question mark
        '\uFF61'  # Halfwidth ideographic full stop
        '\u3002'  # Ideographic full stop
    )
    SPLIT_PAT = '([{}]”?)'.format(STOPS)
    split_pat = SPLIT_PAT
    if len(text) <= maxlen:
        return [text], [0]
    segs = re.split(split_pat, text)
    sentences = []
    for i in range(0, len(segs) - 1, 2):
        sentences.append(segs[i] + segs[i + 1])
    if segs[-1]:
        sentences.append(segs[-1])
    n_sentences = len(sentences)
    sent_lens = [len(s) for s in sentences]
    alls = []  # 所有满足约束条件的最长子片段
    for i in range(n_sentences):
        length = 0
        sub = []
        for j in range(i, n_sentences):
            if length + sent_lens[j] <= maxlen or not sub:
                sub.append(j)
                length += sent_lens[j]
            else:
                break
        alls.append(sub)
        if j == n_sentences - 1:
            if sub[-1] != j:
                alls.append(sub[1:] + [j])
            break

    if len(alls) == 1:
        return [text], [0]

    if greedy:  # 贪婪模式返回所有子文本
        sub_texts = [''.join([sentences[i] for i in sub]) for sub in alls]
        starts = [0] + [sum(sent_lens[:i]) for i in range(1, len(alls))]
        return sub_texts, starts
    else:  # 用动态规划求解满足要求的最优子片段集
        DG = {}  # 有向图
        N = len(alls)
        for k in range(N):
            tmplist = list(range(k + 1, min(alls[k][-1] + 1, N)))
            if not tmplist:
                tmplist.append(k + 1)
            DG[k] = tmplist

        routes = {}
        routes[N] = (0, -1)
        for i in range(N - 1, -1, -1):
            templist = []
            for j in DG[i]:
                cross = set(alls[i]) & (set(alls[j]) if j < len(alls) else set())
                w_ij = sum([sent_lens[k] for k in cross]) ** 2  # 第i个节点与第j个节点交叉度
                w_j = routes[j][0]  # 第j个子问题的值
                w_i_ = w_ij + w_j
                templist.append((w_i_, j))
            routes[i] = min(templist)

        sub_texts, starts = [''.join([sentences[i] for i in alls[0]])], [0]
        k = 0
        while True:
            k = routes[k][1]
            sub_texts.append(''.join([sentences[i] for i in alls[k]]))
            starts.append(sum(sent_lens[: alls[k][0]]))
            if k == N - 1:
                break

    return sub_texts, starts


def check_split_right(text, split_text, split_index):
    # 检查首字是否正确
    for index, value in enumerate(split_text):
        assert value[0] == text[split_index[index]]
    # 检查拼接之后是否正确
    temp_text = ""
    for i in split_text:
        temp_text += i
    assert temp_text == text


def split_text_by_sentence(text, max_length):
    split_punctuation = ["。", "！", "!"]
    split_sentences, split_index = [], [0]
    for char_index, char in enumerate(text):
        if char in split_punctuation:
            split_sentences.append(text[split_index[-1]:char_index + 1])
            split_index.append(char_index + 1)

    split_sentences.append(text[split_index[-1]:])

    # 验证一句话不能超过512个字符
    for i in split_sentences:
        assert len(i) <= max_length

    last_sentence, current_sentence = "", ""
    new_split_sentences, new_split_index = [], [0]
    for index, sentence in enumerate(split_sentences):
        current_sentence += sentence
        if len(current_sentence) > max_length:
            current_sentence = sentence
            new_split_sentences.append(last_sentence)
            new_split_index.append(split_index[index])
        last_sentence = current_sentence
    new_split_sentences.append(last_sentence)

    # 验证下切完之后是否正确
    check_split_right(text, new_split_sentences, new_split_index)

    return new_split_sentences, new_split_index

# text = ['§', '补', '气', '养', '血', '，', '调', '经', '止', '带', '。', '用', '于', '气', '血', '两', '虚', '，', '身', '体', '瘦', '弱', '，', '腰', '膝', '酸', '软', '，', '月', '经', '不', '调', '，', '带', '下', '少', '女', '及', '更', '年', '期', '妇', '女', '应', '在', '医', '师', '指', '导', '下', '服', '用', '。', '5', '.', '平', '素', '月', '经', '正', '常', '，', '突', '然', '出', '现', '月', '经', '过', '少', '，', '或', '经', '期', '错', '后', '，', '或', '阴', '道', '不', '规', '则', '出', '血', '者', '应', '去', '医', '院', '就', '诊', '。', '6', '.', '伴', '有', '赤', '带', '者', '，', '应', '去', '医', '院', '就', '诊', '。', '7', '.', '服', '药', '1', '个', '月', '症', '状', '无', '缓', '解', '，', '应', '去', '医', '院', '就', '诊', '。', '8', '.', '对', '本', '品', '过', '敏', '者', '禁', '用', '，', '过', '敏', '体', '质', '者', '慎', '用', '。', '9', '.', '本', '品', '性', '状', '发', '生', '改', '变', '时', '禁', '止', '使', '用', '。', '1', '0', '.', '请', '将', '本', '品', '放', '在', '儿', '童', '辛', '辣', '、', '生', '冷', '食', '物', '。', '2', '.', '感', '冒', '发', '热', '病', '人', '不', '宜', '服', '用', '。', '3', '.', '有', '高', '血', '压', '、', '心', '脏', '病', '、', '肝', '病', '、', '糖', '尿', '病', '、', '肾', '病', '等', '慢', '性', '病', '造', '血', '和', '止', '血', '作', '用', '。', '本', '品', '能', '促', '进', '环', '磷', '酰', '胺', '所', '致', '白', '细', '胞', '总', '数', '下', '降', '的', '恢', '复', '，', '提', '高', '失', '血', '小', '鼠', '的', '血', '红', '蛋', '白', '含', '量', '，', '缩', '短', '小', '鼠', '出', '血', '时', '间', '和', '血', '浆', '复', '钙', '时', '间', '。', '§', '具', '有', '雌', '激', '素', '样', '作', '用', '。', '本', '品', '可', '增', '加', '雌', '鼠', '子', '宫', '重', '量', '，', '增', '高', '大', '鼠', '子', '宫', '指', '数', '和', '雌', '二', '醇', '含', '量', '，', '动', '物', '出', '现', '动', '情', '期', '的', '比', '率', '增', '多', '。', '§', '具', '有', '保', '肝', '作', '用', '。', '本', '品', '可', '拮', '抗', 'D', '-', '氨', '基', '半', '乳', '糖', '所', '致', '的', '急', '性', '肝', '损', '伤', '大', '鼠', '谷', '丙', '转', '氨', '酶', '和', '谷', '草', '转', '氨', '酶', '值', '的', '升', '高', '；', '增', '加', '四', '氯', '化', '碳', '所', '致', '慢', '性', '肝', '损', '害', '大', '鼠', '的', '总', '蛋', '白', '和', '白', '蛋', '白', '含', '量', '。', '§', '具', '有', '增', '强', '免', '疫', '作', '用', '。', '本', '品', '能', '提', '高', '正', '常', '小', '鼠', '对', '血', '中', '碳', '粒', '的', '清', '除', '速', '度', '和', '抗', '体', '形', '成', '细', '胞', '的', '量', '，', '促', '进', 'B', '细', '胞', '受', '抗', '原', '刺', '激', '后', '的', '分', '裂', '增', '殖', '，', '增', '加', '幼', '鼠', '胸', '腺', '指', '数', '；', '增', '强', '小', '鼠', '腹', '腔', '巨', '噬', '细', '胞', '吞', '噬', '鸡', '红', '细', '胞', '的', '能', '力', '。', '§', '具', '有', '抗', '炎', '作', '用', '。', '本', '品', '能', '抑', '制', '巴', '豆', '油', '所', '致', '小', '鼠', '耳', '廓', '肿', '胀', '，', '抑', '制', '角', '叉', '菜', '胶', '所', '致', '的', '大', '鼠', '足', '肿', '胀', '及', '大', '鼠', '棉', '球', '肉', '芽', '肿', '的', '形', '成', '，', '也', '能', '抑', '制', '羧', '甲', '基', '纤', '维', '素', '所', '致', '腹', '腔', '渗', '出', '液', '中', '白', '细', '胞', '总', '数', '的', '增', '多', '。', '§', '§', '丸', '剂', '(', '水', '蜜', '丸', ')', '§', '§', '如', '果', '服', '用', '任', '何', '其', '他', '药', '品', '请', '告', '知', '医', '师', '或', '药', '师', '，', '包', '括', '任', '何', '从', '药', '房', '、', '超', '市', '或', '保', '健', '品', '商', '店', '购', '买', '的', '非', '处', '方', '药', '品', '。', '§', '本', '药', '内', '所', '含', '人', '参', '、', '白', '芍', '，', '反', '藜', '芦', '，', '忌', '与', '含', '藜', '芦', '的', '药', '物', '同', '用', '。', '§', '本', '药', '内', '所', '含', '甘', '草', '，', '反', '甘', '遂', '、', '大', '戟', '、', '海', '藻', '、', '芫', '花', '，', '忌', '与', '含', '甘', '遂', '、', '大', '戟', '、', '海', '藻', '、', '芫', '花', '的', '药', '物', '同', '用', '。', '服', '药', '期', '间', '避', '免', '与', '生', '冷', '、', '辛', '辣', '、', '荤', '腥', '油', '腻', '、', '不', '易', '消', '化', '食', '品', '同', '用', '，', '戒', '烟', '酒', '，', '以', '防', '助', '湿', '化', '热', '，', '加', '重', '病', '情', '。', '服', '药', '期', '间', '不', '宜', '喝', '茶', '和', '吃', '萝', '卜', '，', '不', '宜', '同', '时', '服', '用', '五', '灵', '脂', '、', '皂', '荚', '或', '其', '制', '剂', '。', '医', '师', '和', '药', '师', '可', '能', '对', '服', '用', '同', '仁', '乌', '鸡', '白', '凤', '丸', '（', '口', '服', '液', '）', '应', '注', '意', '事', '项', '具', '有', '更', '多', '的', '信', '息', '。', '§', '§', '药', '用', '复', '合', '膜', '每', '盒', '装', '1', '0', '袋', '。', '§', '孕', '妇', '禁', '用', '。', '§', '§', '6', 'g', '*', '1', '0', '袋', '§', '§', '1', '.', '忌', '辛', '辣', '、', '生', '冷', '食', '物', '。', '2', '.', '感', '冒', '发', '热', '病', '人', '不', '宜', '服', '用', '。', '3', '.', '有', '高', '血', '压', '、', '心', '脏', '病', '、', '肝', '病', '、', '糖', '尿', '病', '、', '肾', '病', '等', '慢', '性', '病', '严', '重', '者', '应', '在', '医', '师', '指', '导', '下', '服', '用', '。', '4', '.', '青', '春', '期', '少', '女', '及', '更', '年', '期', '妇', '女', '应', '在', '医', '师', '指', '导', '下', '服', '用', '。', '5', '.', '平', '素', '月', '经', '正', '常', '，', '突', '然', '出', '现', '月', '经', '过', '少', '，', '或', '经', '期', '错', '后', '，', '或', '阴', '道', '不', '规', '则', '出', '血', '者', '应', '去', '医', '院', '就', '诊', '。', '6', '.', '伴', '有', '赤', '带', '者', '，', '应', '去', '医', '院', '就', '诊', '。', '7', '.', '服', '药', '1', '个', '月', '症', '状', '无', '缓', '解', '，', '应', '去', '医', '院', '就', '诊', '。', '8', '.', '对', '本', '品', '过', '敏', '者', '禁', '用', '，', '过', '敏', '体', '质', '者', '慎', '用', '。', '9', '.', '本', '品', '性', '状', '发', '生', '改', '变', '时', '禁', '止', '使', '用', '。', '1', '0', '.', '请', '将', '本', '品', '放', '在', '儿', '童', '不', '能', '接', '触', '的', '地', '方', '。', '1', '1', '.', '如', '正', '在', '使', '用', '其', '他', '药', '品', '，', '使', '用', '本', '品', '前', '请', '咨', '询', '医', '师', '或', '药', '师', '。', '§', '§', '药', '用', '复', '合', '膜', '每', '盒', '装', '1', '0', '袋', '。', '§', '§', '具', '有', '促', '进', '造', '血', '和', '止', '血', '作', '用', '。', '本', '品', '能', '促', '进', '环', '磷', '酰', '胺', '所', '致', '白', '细', '胞', '总', '数', '下', '降', '的', '恢', '复', '，', '提', '高', '失', '血', '小', '鼠', '的', '血', '红', '蛋', '白', '含', '量', '，', '缩', '短', '小', '鼠', '出', '血', '时', '间', '和', '血', '浆', '复', '钙', '时', '间', '。', '§', '具', '有', '雌', '激', '素', '样', '作', '用', '。', '本', '品', '可', '增', '加', '雌', '鼠', '子', '宫', '重', '量', '，', '增', '高', '大', '鼠', '子', '宫', '指', '数', '和', '雌', '二', '醇', '含', '量', '，', '动', '物', '出', '现', '动', '情', '期', '的', '比', '率', '增', '多', '。', '§', '具', '有', '保', '肝', '作', '用', '。', '本', '品', '可', '拮', '抗', 'D', '-', '氨', '基', '半', '乳', '糖', '所', '致', '的', '急', '性', '肝', '损', '伤', '大', '鼠', '谷', '丙', '转', '氨', '酶', '和', '谷', '草', '转', '氨', '酶', '值', '的', '升', '高', '；', '增', '加', '四', '氯', '化', '碳', '所', '致', '慢', '性', '肝', '损', '害', '大', '鼠', '的', '总', '蛋', '白', '和', '白', '蛋', '白', '含', '量', '。', '§', '具', '有', '增', '强', '免', '疫', '作', '用', '。', '本', '品', '能', '提', '高', '正', '常', '小', '鼠', '对', '血', '中', '碳', '粒', '的', '清', '除', '速', '度', '和', '抗', '体', '形', '成', '细', '胞', '的', '量', '，', '促', '进', 'B', '细', '胞', '受', '抗', '原', '刺', '激', '后', '的', '分', '裂', '增', '殖', '，', '增', '加', '幼', '鼠', '胸', '腺', '指', '数', '；', '增', '强', '小', '鼠', '腹', '腔', '巨', '噬', '细', '胞', '吞', '噬', '鸡', '红', '细', '胞', '的', '能', '力', '。', '§', '具', '有', '抗', '炎', '作', '用', '。', '本', '品', '能', '抑', '制', '巴', '豆', '油', '所', '致', '小', '鼠', '耳', '廓', '肿', '胀', '，', '抑', '制', '角', '叉', '菜', '胶', '所', '致', '的', '大', '鼠', '足', '肿', '胀', '及', '大', '鼠', '棉', '球', '肉', '芽', '肿', '的', '形', '成', '，', '也', '能', '抑', '制', '羧', '甲', '基', '纤', '维', '素', '所', '致', '腹', '腔', '渗', '出', '液', '中', '白', '细', '胞', '总', '数', '的', '增', '多', '。', '§', '§', '江', '西', '药', '都', '仁', '和', '制', '药', '有', '限', '公', '司', '§', '§', '6', 'g', '*', '1', '0', '袋', '§', '§', '本', '品', '为', '褐', '色', '的', '大', '蜜', '丸', '或', '小', '蜜', '丸', '；', '气', '香', '，', '味', '甜', '、', '微', '苦', '。', '§', '§', '口', '服', '。', '水', '蜜', '丸', '一', '次', '6', '克', '，', '一', '日', '2', '次', '。', '§', '§', '具', '有', '促', '进', '造', '血', '和', '止', '血', '作', '用', '。', '本', '品', '能', '促', '进', '环', '磷', '酰', '胺', '所', '致', '白', '细', '胞', '总', '数', '下', '降', '的', '恢', '复', '，', '提', '高', '失', '血', '小', '鼠', '的', '血', '红', '蛋', '白', '含', '量', '，', '缩', '短', '小', '鼠', '出', '血', '时', '间', '和', '血', '浆', '复', '钙', '时', '间', '。', '§', '具', '有', '雌', '激', '素', '样', '作', '用', '。', '本', '品', '可', '增', '加', '雌', '鼠', '子', '宫', '重', '量', '，', '增', '高', '大', '鼠', '子', '宫', '指', '数', '和', '雌', '二', '醇', '含', '量', '，', '动', '物', '出', '现', '动', '情', '期', '的', '比', '率', '增', '多', '。', '§', '具', '有', '保', '肝', '作', '用', '。', '本', '品', '可', '拮', '抗', 'D', '-', '氨', '基', '半', '乳', '糖', '所', '致', '的', '急', '性', '肝', '损', '伤', '大', '鼠', '谷', '丙', '转', '氨', '酶', '和', '谷', '草', '转', '氨', '酶', '值', '的', '升', '高', '；', '增', '加', '四', '氯', '化', '碳', '所', '致', '慢', '性', '肝', '损', '害', '大', '鼠', '的', '总', '蛋', '白', '和', '白', '蛋', '白', '含', '量', '。', '§', '具', '有', '增', '强', '免', '疫', '作', '用', '。', '本', '品', '能', '提', '高', '正', '常', '小', '鼠', '对', '血', '中', '碳', '粒', '的', '清', '除', '速', '度', '和', '抗', '体', '形', '成', '细', '胞', '的', '量', '，', '促', '进', 'B', '细', '胞', '受', '抗', '原', '刺', '激', '后', '的', '分', '裂', '增', '殖', '，', '增', '加', '幼', '鼠', '胸', '腺', '指', '数', '；', '增', '强', '小', '鼠', '腹', '腔', '巨', '噬', '细', '胞', '吞', '噬', '鸡', '红', '细', '胞', '的', '能', '力', '。', '§', '具', '有', '抗', '炎', '作', '用', '。', '本', '品', '能', '抑', '制', '巴', '豆', '油', '所', '致', '小', '鼠', '耳', '廓', '肿', '胀', '，', '抑', '制', '角', '叉', '菜', '胶', '所', '致', '的', '大', '鼠', '足', '肿', '胀', '及', '大', '鼠', '棉', '球', '肉', '芽', '肿', '的', '形', '成', '，', '也', '能', '抑', '制', '羧', '甲', '基', '纤', '维', '素', '所', '致', '腹', '腔', '渗', '出', '液', '中', '白', '细', '胞', '总', '数', '的', '增', '多', '。', '§', '§', '非', '处', '方', '药', '物', '（', '甲', '类', '）', ',', '国', '家', '基', '本', '药', '物', '目', '录', '（', '2', '0', '1', '2', '）', '§', '§', '江', '西', '药', '都', '仁', '和', '制', '药', '有', '限', '公', '司', '§', '§', '1', '.', '忌', '辛', '辣', '、', '生', '冷', '食', '物', '。', '2', '.', '感', '冒', '发', '热', '病', '人', '不', '宜', '服', '用', '。', '3', '.', '有', '高', '血', '压', '、', '心', '脏', '病', '、', '肝', '病', '、', '糖', '尿', '病', '、', '肾', '病', '等', '慢', '性', '病', '严', '重', '者', '应', '在', '医', '师', '指', '导', '下', '服', '用', '。', '4', '.', '青', '春', '期', '少', '女', '及', '更', '年', '期', '妇', '女', '应', '在', '医', '师', '指', '导', '下', '服', '用', '。', '5', '.', '平', '素', '月', '经', '正', '常', '，', '突', '然', '出', '现', '月', '经', '过', '少', '，', '或', '经', '期', '错', '后', '月', '经', '过', '少', '，', '或', '经', '期', '错', '后', '，', '或', '阴', '道', '不', '规', '则', '出', '血', '者', '应', '去', '医', '院', '就', '诊', '。', '6', '.', '伴', '有', '赤', '带', '保', '肝', '作', '用', '。', '本', '品', '可', '拮', '抗', 'D', '-', '氨', '基', '半', '乳', '糖', '所', '致', '的', '急', '性', '肝', '损', '伤', '大', '鼠', '谷', '丙', '转', '氨', '酶', '和', '谷', '草', '转', '氨', '酶', '值', '的', '升', '高', '；', '增', '加', '四', '氯', '化', '碳', '所', '致', '慢', '性', '肝', '损', '害', '大', '鼠', '的', '总', '蛋', '白', '和', '白', '蛋', '白', '含', '量', '。', '§', '具', '有', '增', '强', '免', '疫', '作', '用', '。', '本', '品', '能', '提', '高', '正', '常', '小', '鼠', '对', '血', '中', '碳', '粒', '的', '清', '除', '速', '度', '和', '抗', '体', '形', '成', '细', '胞', '的', '量', '，', '促', '进', 'B', '细', '胞', '受', '抗', '原', '刺', '激', '后', '的', '分', '裂', '增', '殖', '，', '增', '加', '幼', '鼠', '胸', '腺', '指', '数', '；', '增', '强', '小', '鼠', '腹', '腔', '巨', '噬', '细', '胞', '吞', '噬', '鸡', '红', '细', '胞', '的', '能', '力', '。', '§', '具', '有', '抗', '炎', '作', '用', '。', '本', '品', '能', '抑', '制', '巴', '豆', '油', '所', '致', '小', '鼠', '耳', '廓', '肿', '胀', '，', '抑', '制', '角', '叉', '菜', '胶', '所', '致', '的', '大', '鼠', '足', '肿', '胀', '及', '大', '鼠', '棉', '球', '肉', '芽', '肿', '的', '形', '成', '，', '也', '能', '抑', '制', '羧', '甲', '基', '纤', '维', '素', '所', '致', '腹', '腔', '渗', '出', '液', '中', '白', '细', '胞', '总', '数', '的', '增', '多', '。', '§', '§', '补', '气', '养', '血', '、', '调', '经', '止', '带', '，', '用', '于', '月', '经', '不', '调', '、', '经', '期', '腹', '痛', '§', '§', '具', '有', '促', '进', '造', '血', '和', '止', '血', '作', '用', '。', '本', '品', '能', '促', '进', '环', '磷', '酰', '胺', '所', '致', '白', '细', '胞', '总', '数', '下', '降', '的', '恢', '复', '，', '提', '高', '失', '血', '小', '鼠', '的', '血', '红', '蛋', '白', '含', '量', '，', '缩', '短', '小', '鼠', '出', '血', '时', '间', '和', '血', '浆', '复', '钙', '时', '间', '。', '§', '具', '有', '雌', '激', '素', '样', '作', '用', '。', '本', '品', '可', '增', '加', '雌', '鼠', '子', '宫', '重', '量', '，', '增', '高', '大', '鼠', '子', '宫', '指', '数', '和', '雌', '二', '醇', '含', '量', '，', '动', '物', '出', '现', '动', '情', '期', '的', '比', '率', '增', '多', '。', '§', '具', '有', '保', '肝', '作', '用', '。', '本', '品', '可', '拮', '抗', 'D', '-', '氨', '基', '半', '乳', '糖', '所', '致', '的', '急', '性', '肝', '损', '伤', '大', '鼠', '谷', '丙', '转', '氨', '酶', '和', '谷', '草', '转', '氨', '酶', '值', '的', '升', '高', '；', '增', '加', '四', '氯', '化', '碳', '所', '致', '慢', '性', '肝', '损', '害', '大', '鼠', '的', '总', '蛋', '白', '和', '白', '蛋', '白', '含', '量', '。', '§', '具', '有', '增', '强', '免', '疫', '作', '用', '。', '本', '品', '能', '提', '高', '正', '常', '小', '鼠', '对', '血', '中', '碳', '粒', '的', '清', '除', '速', '度', '和', '抗', '体', '形', '成', '细', '胞', '的', '量', '，', '促', '进', 'B', '细', '胞', '受', '抗', '原', '刺', '激', '后', '的', '分', '裂', '增', '殖', '，', '增', '加', '幼', '鼠', '胸', '腺', '指', '数', '；', '增', '强', '小', '鼠', '腹', '腔', '巨', '噬', '细', '胞', '吞', '噬', '鸡', '红', '细', '胞', '的', '能', '力', '。', '§', '具', '有', '抗', '炎', '作', '用', '。', '本', '品', '能', '抑', '制', '巴', '豆', '油', '所', '致', '小', '鼠', '耳', '廓', '肿', '胀', '，', '抑', '制', '角', '叉', '菜', '胶', '所', '致', '的', '大', '鼠', '足', '肿', '胀', '及', '大', '鼠', '棉', '球', '肉', '芽', '肿', '的', '形', '成', '，', '也', '能', '抑', '制', '羧', '甲', '基', '纤', '维', '素', '所', '致', '腹', '腔', '渗', '出', '液', '中', '白', '细', '胞', '总', '数', '的', '增', '多', '。', '§', '§', '丸', '剂', '(', '水', '蜜', '丸', ')', '§', '§', '补', '气', '养', '血', '、', '调', '经', '止', '带', '，', '用', '于', '月', '经', '不', '调', '、', '经', '期', '腹', '痛', '§', '§', '丸', '剂', '(', '水', '蜜', '丸', ')', '§', '§', '药', '用', '复', '合', '膜', '每', '盒', '装', '1', '0', '袋', '。', '§', '§', '具', '有', '促', '进', '造', '血', '和', '止', '血', '作', '用', '。', '本', '品', '能', '促', '进', '环', '磷', '酰', '胺', '所', '致', '白', '细', '胞', '总', '数', '下', '降', '的', '恢', '复', '，', '提', '高', '失', '血', '小', '鼠', '的', '血', '红', '蛋', '白', '含', '量', '，', '缩', '短', '小', '鼠', '出', '血', '时', '间', '和', '血', '浆', '复', '钙', '时', '间', '。', '§', '具', '有', '雌', '激', '素', '样', '作', '用', '。', '本', '品', '可', '增', '加', '雌', '鼠', '子', '宫', '重', '量', '，', '增', '高', '大', '鼠', '子', '宫', '指', '数', '和', '雌', '二', '醇', '含', '量', '，', '动', '物', '出', '现', '动', '情', '期', '的', '比', '率', '增', '多', '。', '§', '具', '有', '保', '肝', '作', '用', '。', '本', '品', '可', '拮', '抗', 'D', '-', '氨', '基', '半', '乳', '糖', '所', '致', '的', '急', '性', '肝', '损', '伤', '大', '鼠', '谷', '丙', '转', '氨', '酶', '和', '谷', '草', '转', '氨', '酶', '值', '的', '升', '高', '；', '增', '加', '四', '氯', '化', '碳', '所', '致', '慢', '性', '肝', '损', '害', '大', '鼠', '的', '总', '蛋', '白', '和', '白', '蛋', '白', '含', '量', '。', '§', '具', '有', '增', '强', '免', '疫', '作', '用', '。', '本', '品', '能', '提', '高', '正', '常', '小', '鼠', '对', '血', '中', '碳', '粒', '的', '清', '除', '速', '度', '和', '抗', '体', '形', '成', '细', '胞', '的', '量', '，', '促', '进', 'B', '细', '胞', '受', '抗', '原', '刺', '激', '后', '的', '分', '裂', '增', '殖', '，', '增', '加', '幼', '鼠', '胸', '腺', '指', '数', '；', '增', '强', '小', '鼠', '腹', '腔', '巨', '噬', '细', '胞', '吞', '噬', '鸡', '红', '细', '胞', '的', '能', '力', '。', '§', '具', '有', '抗', '炎', '§', '尚', '不', '明', '确', '。', '§', '§', '口', '服', '。', '水', '蜜', '丸', '小', '蜜', '丸', '；', '气', '香', '，', '味', '甜', '、', '微', '苦', '。', '§', '§', '江', '西', '药', '都', '仁', '和', '制', '药', '有', '限', '公', '司', '§', '§', '非', '处', '方', '药', '物', '（', '甲', '类', '）', ',', '国', '家', '基', '本', '药', '物', '目', '录', '（', '2', '0', '1', '2', '）', '§']
# text = ['§', '尚', '不', '明', '确', '。', '§', '§', '活', '血', '调', '经', '。', '用', '于', '血', '瘀', '所', '致', '的', '月', '经', '不', '调', '，', '症', '见', '经', '水', '量', '多', '§', '开', '水', '冲', '服', '。', '一', '次', '1', '袋', '，', '一', '日', '2', '次', '。', '§', '§', '祛', '瘀', '生', '新', '。', '用', '于', '月', '经', '量', '少', '、', '后', '错', '，', '经', '来', '腹', '痛', '§', '§', '1', '5', 'g', '*', '8', '袋', '§', '§', '1', '.', '忌', '食', '生', '冷', '食', '物', '。', '2', '.', '气', '血', '两', '虚', '引', '起', '的', '月', '经', '量', '少', '，', '色', '淡', '质', '稀', '，', '伴', '有', '头', '晕', '心', '悸', '，', '疲', '乏', '无', '力', '等', '不', '宜', '选', '用', '本', '药', '。', '3', '.', '有', '高', '血', '压', '、', '心', '脏', '病', '、', '肾', '病', '、', '糖', '尿', '病', '或', '正', '在', '接', '受', '其', '他', '治', '疗', '的', '患', '者', '均', '应', '在', '医', '师', '指', '导', '下', '服', '用', '。', '4', '.', '平', '素', '月', '经', '量', '正', '常', '，', '突', '然', '出', '现', '经', '量', '少', '，', '须', '去', '医', '院', '就', '诊', '。', '5', '.', '青', '春', '期', '少', '女', '及', '更', '年', '期', '妇', '女', '应', '在', '医', '师', '指', '导', '下', '服', '药', '。', '6', '.', '各', '种', '流', '产', '后', '腹', '痛', '伴', '有', '阴', '道', '出', '血', '，', '服', '药', '一', '周', '无', '效', '者', '应', '去', '医', '院', '就', '诊', '。', '7', '.', '儿', '童', '、', '哺', '乳', '期', '妇', '女', '、', '老', '人', '等', '用', '药', '应', '在', '医', '师', '指', '导', '下', '使', '用', '。', '8', '.', '按', '照', '用', '法', '用', '量', '服', '用', '，', '服', '药', '过', '程', '中', '出', '现', '不', '良', '反', '应', '应', '停', '药', '，', '并', '向', '医', '师', '咨', '询', '。', '9', '.', '对', '本', '品', '过', '敏', '者', '禁', '用', '，', '过', '敏', '体', '质', '者', '慎', '用', '。', '1', '0', '.', '本', '品', '性', '状', '发', '生', '改', '变', '时', '禁', '止', '使', '用', '。', '1', '1', '.', '请', '将', '本', '品', '放', '在', '儿', '童', '不', '能', '接', '触', '的', '地', '方', '。', '1', '2', '.', '如', '正', '在', '使', '用', '其', '他', '药', '品', '，', '使', '用', '本', '品', '前', '请', '咨', '询', '医', '师', '或', '药', '师', '。', '§', '§', '。', '如', '与', '其', '他', '药', '物', '同', '时', '使', '用', '可', '能', '会', '发', '生', '药', '物', '相', '互', '作', '用', '，', '详', '情', '请', '咨', '询', '医', '师', '或', '药', '师', '。', '§', '§', '尚', '不', '明', '确', '。', '§', '§', '非', '处', '方', '药', '物', '（', '乙', '类', '）', ',', '国', '家', '基', '本', '药', '物', '目', '录', '（', '2', '0', '1', '2', '）', '§', '§', '1', '5', 'g', '*', '8', '袋', '§', '§', '开', '水', '冲', '服', '。', '一', '次', '1', '袋', '，', '一', '日', '2', '次', '。', '§', '§', '孕', '妇', '禁', '用', '。', '§', '§', '。', '如', '与', '其', '他', '药', '物', '同', '时', '使', '用', '可', '能', '会', '发', '生', '药', '物', '相', '互', '作', '用', '，', '详', '情', '请', '咨', '询', '医', '师', '或', '药', '师', '。', '§', '§', '1', '.', '忌', '食', '生', '冷', '食', '物', '味', '甜', '、', '微', '苦', '颗', '粒', '；', '味', '甜', '、', '微', '苦', '。', '§', '§', '本', '品', '为', '棕', '黄', '色', '至', '棕', '褐', '色', '的', '颗', '粒', '；', '味', '甜', '、', '微', '苦', '。', '§', '§', '北', '京', '同', '仁', '堂', '天', '然', '药', '物', '(', '唐', '山', ')', '有', '限', '公', '司', '§', '§', '北', '京', '同', '仁', '堂', '天', '然', '药', '物', '(', '唐', '山', ')', '有', '限', '公', '司', '§', '§', '祛', '瘀', '生', '新', '。', '用', '于', '月', '经', '量', '少', '、', '后', '错', '，', '经', '来', '腹', '痛', '§', '§', '孕', '妇', '禁', '用', '。', '§', '§', '1', '5', 'g', '*', '8', '袋', '§', '§', '非', '处', '方', '药', '物', '（', '乙', '类', '）', ',', '国', '家', '基', '本', '药', '物', '目', '录', '（', '2', '0', '1', '2', '）', '§', '§', '1', '5', 'g', '*', '8', '袋', '§']
# text = ['§', '非', '处', '方', '药', '物', '（', '甲', '类', '）', '§', '§', '6', 'g', '*', '1', '0', '袋', '/', '盒', '§', '§', '丸', '剂', '(', '水', '蜜', '丸', ')', '§', '§', '用', '于', '子', '宫', '寒', '冷', '，', '月', '经', '量', '少', '、', '后', '错', '，', '痛', '经', '§', '如', '与', '其', '他', '药', '物', '同', '时', '使', '用', '可', '能', '会', '发', '生', '药', '物', '相', '互', '作', '用', '，', '详', '情', '请', '咨', '询', '医', '师', '或', '§', '药', '师', '。', '§', '§', '复', '合', '膜', '，', '1', '0', '袋', '/', '盒', '。', '§', '§', '本', '品', '为', '黑', '色', '的', '水', '蜜', '丸', '；', '味', '苦', '、', '甜', '、', '略', '涩', '。', '§', '§', '1', '.', '忌', '食', '生', '冷', '食', '物', '。', '§', '<', 'b', 'r', '/', '>', '2', '.', '感', '冒', '时', '不', '宜', '服', '用', '。', '患', '有', '其', '他', '疾', '病', '者', '，', '应', '在', '医', '师', '指', '导', '下', '服', '用', '。', '§', '<', 'b', 'r', '/', '>', '3', '.', '平', '素', '月', '经', '正', '常', '，', '突', '然', '出', '现', '月', '经', '过', '少', '，', '或', '经', '期', '错', '后', '，', '或', '阴', '道', '不', '规', '则', '出', '血', '，', '或', '带', '下', '伴', '阴', '痒', '，', '或', '赤', '带', '者', '应', '去', '医', '院', '就', '诊', '。', '§', '<', 'b', 'r', '/', '>', '4', '.', '治', '疗', '痛', '经', '，', '宜', '在', '经', '前', '3', '～', '5', '天', '开', '始', '服', '药', '，', '连', '服', '1', '周', '。', '如', '有', '生', '育', '要', '求', '，', '应', '在', '医', '师', '指', '导', '下', '服', '用', '。', '§', '<', 'b', 'r', '/', '>', '5', '.', '服', '药', '后', '痛', '经', '不', '减', '轻', '，', '或', '重', '度', '痛', '痛', '经', '不', '减', '轻', '，', '或', '重', '度', '痛', '经', '者', '，', '应', '到', '医', '院', '诊', '治', '。', '§', '<', 'b', 'r', '/', '>', '6', '.', '服', '药', '2', '周', '症', '状', '无', '缓', '解', '，', '应', '去', '医', '院', '就', '诊', '。', '§', '<', 'b', 'r', '/', '>', '7', '.', '对', '本', '品', '过', '敏', '者', '禁', '用', '，', '过', '敏', '体', '质', '者', '慎', '用', '。', '§', '<', 'b', 'r', '/', '>', '8', '.', '本', '品', '性', '状', '发', '生', '改', '变', '时', '禁', '止', '使', '用', '。', '§', '<', 'b', 'r', '/', '>', '9', '.', '请', '将', '本', '品', '放', '在', '儿', '童', '不', '能', '接', '触', '的', '地', '方', '。', '§', '<', 'b', 'r', '/', '>', '1', '0', '.', '如', '正', '在', '使', '用', '其', '他', '药', '品', '，', '使', '用', '本', '品', '前', '请', '咨', '询', '医', '师', '或', '药', '师', '。', '§', '补', '气', '养', '血', '，', '调', '经', '止', '带', '。', '用', '于', '气', '血', '凝', '滞', '，', '子', '宫', '寒', '冷', '，', '月', '经', '量', '少', '、', '后', '错', '，', '痛', '经', '，', '白', '带', '量', '多', '，', '小', '腹', '下', '坠', '，', '不', '思', '饮', '食', '§', '口', '服', ',', '一', '次', '1', '袋', '（', '6', '克', '）', '，', '一', '日', '2', '-', '3', '次', '。', '§', '孕', '妇', '禁', '用', '。', '糖', '尿', '病', '患', '者', '禁', '服', '。', '§', '§', '昆', '明', '中', '药', '厂', '有', '限', '公', '司', '§']
# text = "".join(text)
# sub_texts, starts = split_text(text, 500, split_pat=None, greedy=False)
# print(len(text))
# print(len(starts))
# for sub_index,sub_text in enumerate(sub_texts):
# 	print(starts[sub_index] , len(sub_text), sub_text)
# 	if text[starts[sub_index]:starts[sub_index]+len(sub_text)] == sub_text:
# 		print("切割后，文本找到了")
